thereivn/LAB6-NRV-SMO/esp32/output/ESP32_CAM_Results.c
/* Main Simulation File */

#if defined(__cplusplus)
extern "C" {
#endif

#include "/output/ESP32_CAM_Results_model.h"
#include "simulation/solver/events.h"

/* FIXME these defines are ugly and hard to read, why not use direct function pointers instead? */
#define prefixedName_performSimulation _output_ESP32_CAM_Results_performSimulation
#define prefixedName_updateContinuousSystem _output_ESP32_CAM_Results_updateContinuousSystem
#include <simulation/solver/perform_simulation.c.inc>

#define prefixedName_performQSSSimulation _output_ESP32_CAM_Results_performQSSSimulation
#include <simulation/solver/perform_qss_simulation.c.inc>


/* dummy VARINFO and FILEINFO */
const VAR_INFO dummyVAR_INFO = omc_dummyVarInfo;

int _output_ESP32_CAM_Results_input_function(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_input_function_init(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_input_function_updateStartValues(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_inputNames(DATA *data, char ** names){
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_data_function(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_dataReconciliationInputNames(DATA *data, char ** names){
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_dataReconciliationUnmeasuredVariables(DATA *data, char ** names)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_output_function(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_setc_function(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}

int _output_ESP32_CAM_Results_setb_function(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}


/*
equation index: 16
type: SIMPLE_ASSIGN
T_celsius = -273.15 + T_chip
*/
void _output_ESP32_CAM_Results_eqFunction_16(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,16};
  (data->localData[0]->realVars[4] /* T_celsius variable */) = -273.15 + (data->localData[0]->realVars[0] /* T_chip STATE(1) */);
  TRACE_POP
}
/*
equation index: 21
type: LINEAR

<var>T_heatsink</var>
<row>

</row>
<matrix>
</matrix>
*/
OMC_DISABLE_OPT
void _output_ESP32_CAM_Results_eqFunction_21(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,21};
  /* Linear equation system */
  int retValue;
  double aux_x[1] = { (data->localData[1]->realVars[5] /* T_heatsink variable */) };
  if(ACTIVE_STREAM(LOG_DT))
  {
    infoStreamPrint(LOG_DT, 1, "Solving linear system 21 (STRICT TEARING SET if tearing enabled) at time = %18.10e", data->localData[0]->timeValue);
    messageClose(LOG_DT);
  }
  
  retValue = solve_linear_system(data, threadData, 1, &aux_x[0]);
  
  /* check if solution process was successful */
  if (retValue > 0){
    const int indexes[2] = {1,21};
    throwStreamPrintWithEquationIndexes(threadData, omc_dummyFileInfo, indexes, "Solving linear system 21 failed at time=%.15g.\nFor more information please use -lv LOG_LS.", data->localData[0]->timeValue);
  }
  /* write solution */
  (data->localData[0]->realVars[5] /* T_heatsink variable */) = aux_x[0];

  TRACE_POP
}
/*
equation index: 22
type: SIMPLE_ASSIGN
mode = if time < t_video then 1 else if time < t_video + t_processing then 2 else if time < t_video + t_processing + t_sleep then 3 else 1
*/
void _output_ESP32_CAM_Results_eqFunction_22(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,22};
  modelica_boolean tmp0;
  modelica_real tmp1;
  modelica_real tmp2;
  modelica_boolean tmp3;
  modelica_real tmp4;
  modelica_real tmp5;
  modelica_boolean tmp6;
  modelica_real tmp7;
  modelica_real tmp8;
  modelica_boolean tmp9;
  modelica_integer tmp10;
  modelica_boolean tmp11;
  modelica_integer tmp12;
  tmp1 = 1.0;
  tmp2 = fabs((data->simulationInfo->realParameter[15] /* t_video PARAM */));
  relationhysteresis(data, &tmp0, data->localData[0]->timeValue, (data->simulationInfo->realParameter[15] /* t_video PARAM */), tmp1, tmp2, 0, Less, LessZC);
  tmp11 = (modelica_boolean)tmp0;
  if(tmp11)
  {
    tmp12 = ((modelica_integer) 1);
  }
  else
  {
    tmp4 = 1.0;
    tmp5 = fabs((data->simulationInfo->realParameter[15] /* t_video PARAM */)) + fabs((data->simulationInfo->realParameter[13] /* t_processing PARAM */));
    relationhysteresis(data, &tmp3, data->localData[0]->timeValue, (data->simulationInfo->realParameter[15] /* t_video PARAM */) + (data->simulationInfo->realParameter[13] /* t_processing PARAM */), tmp4, tmp5, 1, Less, LessZC);
    tmp9 = (modelica_boolean)tmp3;
    if(tmp9)
    {
      tmp10 = ((modelica_integer) 2);
    }
    else
    {
      tmp7 = 1.0;
      tmp8 = fabs((data->simulationInfo->realParameter[15] /* t_video PARAM */)) + fabs((data->simulationInfo->realParameter[13] /* t_processing PARAM */)) + fabs((data->simulationInfo->realParameter[14] /* t_sleep PARAM */));
      relationhysteresis(data, &tmp6, data->localData[0]->timeValue, (data->simulationInfo->realParameter[15] /* t_video PARAM */) + (data->simulationInfo->realParameter[13] /* t_processing PARAM */) + (data->simulationInfo->realParameter[14] /* t_sleep PARAM */), tmp7, tmp8, 2, Less, LessZC);
      tmp10 = (tmp6?((modelica_integer) 3):((modelica_integer) 1));
    }
    tmp12 = tmp10;
  }
  (data->localData[0]->integerVars[0] /* mode DISCRETE */) = tmp12;
  TRACE_POP
}
/*
equation index: 23
type: SIMPLE_ASSIGN
i_load = if mode == 1 then I_video else if mode == 2 then I_processing else I_sleep
*/
void _output_ESP32_CAM_Results_eqFunction_23(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,23};
  (data->localData[0]->realVars[7] /* i_load variable */) = (((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 1))?(data->simulationInfo->realParameter[3] /* I_video PARAM */):(((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 2))?(data->simulationInfo->realParameter[1] /* I_processing PARAM */):(data->simulationInfo->realParameter[2] /* I_sleep PARAM */)));
  TRACE_POP
}
/*
equation index: 24
type: SIMPLE_ASSIGN
battery_charge = Q_initial + 0.0002777777777777778 * (-i_load) * time
*/
void _output_ESP32_CAM_Results_eqFunction_24(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,24};
  (data->localData[0]->realVars[6] /* battery_charge variable */) = (data->simulationInfo->realParameter[6] /* Q_initial PARAM */) + (0.0002777777777777778) * (((-(data->localData[0]->realVars[7] /* i_load variable */))) * (data->localData[0]->timeValue));
  TRACE_POP
}
/*
equation index: 25
type: SIMPLE_ASSIGN
SoC = max(0.0, battery_charge / Q_initial * 100.0)
*/
void _output_ESP32_CAM_Results_eqFunction_25(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,25};
  (data->localData[0]->realVars[2] /* SoC variable */) = fmax(0.0,(DIVISION_SIM((data->localData[0]->realVars[6] /* battery_charge variable */),(data->simulationInfo->realParameter[6] /* Q_initial PARAM */),"Q_initial",equationIndexes)) * (100.0));
  TRACE_POP
}
/*
equation index: 26
type: SIMPLE_ASSIGN
power_consumption = i_load * V_battery
*/
void _output_ESP32_CAM_Results_eqFunction_26(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,26};
  (data->localData[0]->realVars[9] /* power_consumption variable */) = ((data->localData[0]->realVars[7] /* i_load variable */)) * ((data->simulationInfo->realParameter[12] /* V_battery PARAM */));
  TRACE_POP
}
/*
equation index: 27
type: SIMPLE_ASSIGN
p_dissipation = if mode == 1 then P_active else if mode == 2 then P_active else P_sleep
*/
void _output_ESP32_CAM_Results_eqFunction_27(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,27};
  (data->localData[0]->realVars[8] /* p_dissipation variable */) = (((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 1))?(data->simulationInfo->realParameter[4] /* P_active PARAM */):(((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 2))?(data->simulationInfo->realParameter[4] /* P_active PARAM */):(data->simulationInfo->realParameter[5] /* P_sleep PARAM */)));
  TRACE_POP
}
/*
equation index: 28
type: SIMPLE_ASSIGN
$DER.T_chip = (p_dissipation + (T_case - T_chip) / R_chip_case) / C_chip
*/
void _output_ESP32_CAM_Results_eqFunction_28(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,28};
  (data->localData[0]->realVars[1] /* der(T_chip) STATE_DER */) = DIVISION_SIM((data->localData[0]->realVars[8] /* p_dissipation variable */) + DIVISION_SIM((data->localData[0]->realVars[3] /* T_case variable */) - (data->localData[0]->realVars[0] /* T_chip STATE(1) */),(data->simulationInfo->realParameter[8] /* R_chip_case PARAM */),"R_chip_case",equationIndexes),(data->simulationInfo->realParameter[0] /* C_chip PARAM */),"C_chip",equationIndexes);
  TRACE_POP
}
/*
equation index: 29
type: SIMPLE_ASSIGN
t_next_switch = if mode == 1 then t_video - mod(time, t_video + t_processing + t_sleep, 0) else if mode == 2 then t_processing - mod(time - t_video, t_video + t_processing + t_sleep, 3) else t_sleep - mod(time - t_video - t_processing, t_video + t_processing + t_sleep, 6)
*/
void _output_ESP32_CAM_Results_eqFunction_29(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  const int equationIndexes[2] = {1,29};
  (data->localData[0]->realVars[10] /* t_next_switch variable */) = (((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 1))?(data->simulationInfo->realParameter[15] /* t_video PARAM */) - _event_mod_real(data->localData[0]->timeValue, (data->simulationInfo->realParameter[15] /* t_video PARAM */) + (data->simulationInfo->realParameter[13] /* t_processing PARAM */) + (data->simulationInfo->realParameter[14] /* t_sleep PARAM */), ((modelica_integer) 0), data, threadData):(((data->localData[0]->integerVars[0] /* mode DISCRETE */) == ((modelica_integer) 2))?(data->simulationInfo->realParameter[13] /* t_processing PARAM */) - _event_mod_real(data->localData[0]->timeValue - (data->simulationInfo->realParameter[15] /* t_video PARAM */), (data->simulationInfo->realParameter[15] /* t_video PARAM */) + (data->simulationInfo->realParameter[13] /* t_processing PARAM */) + (data->simulationInfo->realParameter[14] /* t_sleep PARAM */), ((modelica_integer) 3), data, threadData):(data->simulationInfo->realParameter[14] /* t_sleep PARAM */) - _event_mod_real(data->localData[0]->timeValue - (data->simulationInfo->realParameter[15] /* t_video PARAM */) - (data->simulationInfo->realParameter[13] /* t_processing PARAM */), (data->simulationInfo->realParameter[15] /* t_video PARAM */) + (data->simulationInfo->realParameter[13] /* t_processing PARAM */) + (data->simulationInfo->realParameter[14] /* t_sleep PARAM */), ((modelica_integer) 6), data, threadData)));
  TRACE_POP
}

