thereivn/LAB6-NRV-SMO/esp32/output/ESP32_CAM_Results.c
OMC_DISABLE_OPT
int _output_ESP32_CAM_Results_functionDAE(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
  int equationIndexes[1] = {0};
#if !defined(OMC_MINIMAL_RUNTIME)
  if (measure_time_flag) rt_tick(SIM_TIMER_DAE);
#endif

  data->simulationInfo->needToIterate = 0;
  data->simulationInfo->discreteCall = 1;
  _output_ESP32_CAM_Results_functionLocalKnownVars(data, threadData);
  _output_ESP32_CAM_Results_eqFunction_16(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_21(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_22(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_23(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_24(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_25(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_26(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_27(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_28(data, threadData);

  _output_ESP32_CAM_Results_eqFunction_29(data, threadData);
  data->simulationInfo->discreteCall = 0;
  
#if !defined(OMC_MINIMAL_RUNTIME)
  if (measure_time_flag) rt_accumulate(SIM_TIMER_DAE);
#endif
  TRACE_POP
  return 0;
}


int _output_ESP32_CAM_Results_functionLocalKnownVars(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH

  
  TRACE_POP
  return 0;
}


/* forwarded equations */
extern void _output_ESP32_CAM_Results_eqFunction_21(DATA* data, threadData_t *threadData);
extern void _output_ESP32_CAM_Results_eqFunction_22(DATA* data, threadData_t *threadData);
extern void _output_ESP32_CAM_Results_eqFunction_27(DATA* data, threadData_t *threadData);
extern void _output_ESP32_CAM_Results_eqFunction_28(DATA* data, threadData_t *threadData);

static void functionODE_system0(DATA *data, threadData_t *threadData)
{
  {
    _output_ESP32_CAM_Results_eqFunction_21(data, threadData);
    threadData->lastEquationSolved = 21;
  }
  {
    _output_ESP32_CAM_Results_eqFunction_22(data, threadData);
    threadData->lastEquationSolved = 22;
  }
  {
    _output_ESP32_CAM_Results_eqFunction_27(data, threadData);
    threadData->lastEquationSolved = 27;
  }
  {
    _output_ESP32_CAM_Results_eqFunction_28(data, threadData);
    threadData->lastEquationSolved = 28;
  }
}

int _output_ESP32_CAM_Results_functionODE(DATA *data, threadData_t *threadData)
{
  TRACE_PUSH
#if !defined(OMC_MINIMAL_RUNTIME)
  if (measure_time_flag) rt_tick(SIM_TIMER_FUNCTION_ODE);
#endif

  
  data->simulationInfo->callStatistics.functionODE++;
  
  _output_ESP32_CAM_Results_functionLocalKnownVars(data, threadData);
  functionODE_system0(data, threadData);

#if !defined(OMC_MINIMAL_RUNTIME)
  if (measure_time_flag) rt_accumulate(SIM_TIMER_FUNCTION_ODE);
#endif

  TRACE_POP
  return 0;
}

/* forward the main in the simulation runtime */
extern int _main_SimulationRuntime(int argc, char**argv, DATA *data, threadData_t *threadData);

#include "/output/ESP32_CAM_Results_12jac.h"
#include "/output/ESP32_CAM_Results_13opt.h"

struct OpenModelicaGeneratedFunctionCallbacks _output_ESP32_CAM_Results_callback = {
   (int (*)(DATA *, threadData_t *, void *)) _output_ESP32_CAM_Results_performSimulation,    /* performSimulation */
   (int (*)(DATA *, threadData_t *, void *)) _output_ESP32_CAM_Results_performQSSSimulation,    /* performQSSSimulation */
   _output_ESP32_CAM_Results_updateContinuousSystem,    /* updateContinuousSystem */
   _output_ESP32_CAM_Results_callExternalObjectDestructors,    /* callExternalObjectDestructors */
   NULL,    /* initialNonLinearSystem */
   _output_ESP32_CAM_Results_initialLinearSystem,    /* initialLinearSystem */
   NULL,    /* initialMixedSystem */
   #if !defined(OMC_NO_STATESELECTION)
   _output_ESP32_CAM_Results_initializeStateSets,
   #else
   NULL,
   #endif    /* initializeStateSets */
   _output_ESP32_CAM_Results_initializeDAEmodeData,
   _output_ESP32_CAM_Results_functionODE,
   _output_ESP32_CAM_Results_functionAlgebraics,
   _output_ESP32_CAM_Results_functionDAE,
   _output_ESP32_CAM_Results_functionLocalKnownVars,
   _output_ESP32_CAM_Results_input_function,
   _output_ESP32_CAM_Results_input_function_init,
   _output_ESP32_CAM_Results_input_function_updateStartValues,
   _output_ESP32_CAM_Results_data_function,
   _output_ESP32_CAM_Results_output_function,
   _output_ESP32_CAM_Results_setc_function,
   _output_ESP32_CAM_Results_setb_function,
   _output_ESP32_CAM_Results_function_storeDelayed,
   _output_ESP32_CAM_Results_function_storeSpatialDistribution,
   _output_ESP32_CAM_Results_function_initSpatialDistribution,
   _output_ESP32_CAM_Results_updateBoundVariableAttributes,
   _output_ESP32_CAM_Results_functionInitialEquations,
   1, /* useHomotopy - 0: local homotopy (equidistant lambda), 1: global homotopy (equidistant lambda), 2: new global homotopy approach (adaptive lambda), 3: new local homotopy approach (adaptive lambda)*/
   NULL,
   _output_ESP32_CAM_Results_functionRemovedInitialEquations,
   _output_ESP32_CAM_Results_updateBoundParameters,
   _output_ESP32_CAM_Results_checkForAsserts,
   _output_ESP32_CAM_Results_function_ZeroCrossingsEquations,
   _output_ESP32_CAM_Results_function_ZeroCrossings,
   _output_ESP32_CAM_Results_function_updateRelations,
   _output_ESP32_CAM_Results_zeroCrossingDescription,
   _output_ESP32_CAM_Results_relationDescription,
   _output_ESP32_CAM_Results_function_initSample,
   _output_ESP32_CAM_Results_INDEX_JAC_A,
   _output_ESP32_CAM_Results_INDEX_JAC_B,
   _output_ESP32_CAM_Results_INDEX_JAC_C,
   _output_ESP32_CAM_Results_INDEX_JAC_D,
   _output_ESP32_CAM_Results_INDEX_JAC_F,
   _output_ESP32_CAM_Results_INDEX_JAC_H,
   _output_ESP32_CAM_Results_initialAnalyticJacobianA,
   _output_ESP32_CAM_Results_initialAnalyticJacobianB,
   _output_ESP32_CAM_Results_initialAnalyticJacobianC,
   _output_ESP32_CAM_Results_initialAnalyticJacobianD,
   _output_ESP32_CAM_Results_initialAnalyticJacobianF,
   _output_ESP32_CAM_Results_initialAnalyticJacobianH,
   _output_ESP32_CAM_Results_functionJacA_column,
   _output_ESP32_CAM_Results_functionJacB_column,
   _output_ESP32_CAM_Results_functionJacC_column,
   _output_ESP32_CAM_Results_functionJacD_column,
   _output_ESP32_CAM_Results_functionJacF_column,
   _output_ESP32_CAM_Results_functionJacH_column,
   _output_ESP32_CAM_Results_linear_model_frame,
   _output_ESP32_CAM_Results_linear_model_datarecovery_frame,
   _output_ESP32_CAM_Results_mayer,
   _output_ESP32_CAM_Results_lagrange,
   _output_ESP32_CAM_Results_pickUpBoundsForInputsInOptimization,
   _output_ESP32_CAM_Results_setInputData,
   _output_ESP32_CAM_Results_getTimeGrid,
   _output_ESP32_CAM_Results_symbolicInlineSystem,
   _output_ESP32_CAM_Results_function_initSynchronous,
   _output_ESP32_CAM_Results_function_updateSynchronous,
   _output_ESP32_CAM_Results_function_equationsSynchronous,
   _output_ESP32_CAM_Results_inputNames,
   _output_ESP32_CAM_Results_dataReconciliationInputNames,
   _output_ESP32_CAM_Results_dataReconciliationUnmeasuredVariables,
   NULL,
   NULL,
   NULL,
   -1,
   NULL,
   NULL,
   -1

